app/views/recipes/_form.html.erb

  <div id="ingredients-container">
    <% @recipe.recipe_ingredients.each do |recipe_ingredient| %>
---
SELECT "ingredients".* FROM "ingredients"
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]

            <%= ri.label :ingredient_id, "Ingredient", class: "form-label d-inline-block me-2" %>
            <%= ri.select :ingredient_id, Ingredient.all.collect { |ing| [ing.ingr_name, ing.id] }, { include_blank: true }, class: "form-control d-inline-block" %>
---
SELECT "ingredients".* FROM "ingredients"