app/controllers/home_controller.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "recipes".* FROM "recipes" LIMIT ?  [["LIMIT", 5]]
---
  def index
    @recipes = Recipe.includes(:ingredients).take(5)

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 15], ["id", 6], ["id", 9], ["id", 16], ["id", 18], ["id", 43]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 15]]
---
  def urecipes
    @recipes = Recipe.includes(:ingredients).where(user_id: session[:user_id])