app/controllers/users_controller.rb

  def index
    # @users = User.all
    if logged_in? && is_administrator?  #check if the logged in user is an admin
      @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)